nuxeo-wss/src/test/resources/WebUrlFromPageUrl.dump

POST /_vti_bin/webs.asmx HTTP/1.1
Content-Type: text/xml; charset=utf-8
SOAPAction: http://schemas.microsoft.com/sharepoint/soap/WebUrlFromPageUrl
X-Office-Version: 11.0.5606
User-Agent: Microsoft Office/11.0 (Windows NT 5.1; Microsoft Office Word 11.0.5606; Std)
Host: vm2k3
Content-Length: 283
Connection: Keep-Alive
Cache-Control: no-cache
Cookie: MSOWebPartPage_AnonymousAccessCookie=80; WSS_KeepSessionAuthenticated=80

<?xml version='1.0' ?><s:Envelope xmlns:s="http://schemas.xmlsoap.org/soap/envelope/"><s:Body><WebUrlFromPageUrl xmlns="http://schemas.microsoft.com/sharepoint/soap/"><pageUrl>http://vm2k3/MyDocList/Nuxeo%20Annotation%20Service.doc</pageUrl></WebUrlFromPageUrl></s:Body></s:Envelope>
